Revit 2027 API
LightShapeStyle Enumeration
 Tags for specific light shape styles
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LightShapeStyle
Public Enumeration LightShapeStyle
public enum class LightShapeStyle
type LightShapeStyle
Members
Member name | Value | Description
Circle | 3 |  Circular light shape.
Line | 1 |  Line light shape.
Point | 0 |  Point light shape.
Rectangle | 2 |  Rectangular light shape.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace